# US - Baby Names

### Introduction:

We are going to use a subset of [US Baby Names](https://www.kaggle.com/kaggle/us-baby-names) from Kaggle.  
In the file it will be names from 2004 until 2014


### Step 1. Import the necessary libraries

In [0]:
import numpy as np
import pandas as pd

### Step 2. Import the dataset from this [address](https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/06_Stats/US_Baby_Names/US_Baby_Names_right.csv).

### Step 3. Assign it to a variable called baby_names.

In [19]:
baby_names = pd.read_csv("https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/06_Stats/US_Baby_Names/US_Baby_Names_right.csv")
baby_names.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1016395 entries, 0 to 1016394
Data columns (total 7 columns):
Unnamed: 0    1016395 non-null int64
Id            1016395 non-null int64
Name          1016395 non-null object
Year          1016395 non-null int64
Gender        1016395 non-null object
State         1016395 non-null object
Count         1016395 non-null int64
dtypes: int64(4), object(3)
memory usage: 54.3+ MB

### Step 4. See the first 10 entries

In [20]:
baby_names.head(10)

   Unnamed: 0     Id      Name  Year Gender State  Count
0       11349  11350      Emma  2004      F    AK     62
1       11350  11351   Madison  2004      F    AK     48
2       11351  11352    Hannah  2004      F    AK     46
3       11352  11353     Grace  2004      F    AK     44
4       11353  11354     Emily  2004      F    AK     41
5       11354  11355   Abigail  2004      F    AK     37
6       11355  11356    Olivia  2004      F    AK     33
7       11356  11357  Isabella  2004      F    AK     30
8       11357  11358    Alyssa  2004      F    AK     29
9       11358  11359    Sophia  2004      F    AK     28

### Step 5. Delete the column 'Unnamed: 0' and 'Id'

In [22]:
# One more method

del baby_names['Unnamed: 0']
del baby_names['Id']

baby_names.head()

      Name  Year Gender State  Count
0     Emma  2004      F    AK     62
1  Madison  2004      F    AK     48
2   Hannah  2004      F    AK     46
3    Grace  2004      F    AK     44
4    Emily  2004      F    AK     41

### Step 6. Is there more male or female names in the dataset?

In [23]:
baby_names['Gender'].value_counts()                    # females are more in dataset.

F    558846
M    457549
Name: Gender, dtype: int64

### Step 7. Group the dataset by name and assign to names

In [0]:
del baby_names['Year']

In [30]:
names = baby_names.groupby('Name').sum().sort_values('Count', ascending = False)
names.head()

           Count
Name
Jacob     242874
Emma      214852
Michael   214405
Ethan     209277
Isabella  204798

### Step 8. How many different names exist in the dataset?

In [32]:
print(names.nunique())
print (len(names))

Count    3279
dtype: int64
17632

### Step 9. What is the name with most occurrences?

In [37]:
print (names.Count.idxmax())

Jacob

### Step 10. How many different names have the least occurrences?

In [43]:
names[names.Count == names.Count.min()]

print (len(names[names.Count == names.Count.min()]))

2578

### Step 11. What is the median name occurrence?

In [45]:
print (names.Count.median())

49.0

In [46]:
print (names[names.Count == names.Count.median()])

            Count
Name
Zuleima        49
Vita           49
Aziah          49
Kaedence       49
Antonina       49
Nabeel         49
Leylanie       49
Mariann        49
Iven           49
Gurshaan       49
Reghan         49
Emmaly         49
Kaelee         49
Emmanuela      49
Rubin          49
Deserae        49
Envy           49
Baily          49
Kaio           49
Maisha         49
Dahlila        49
Alara          49
Sanjuanita     49
Jaiyana        49
Fay            49
Ridwan         49
Devean         49
Kailana        49
Jaice          49
Caleah         49
...           ...
Sameera        49
Skylie         49
Aishani        49
Carlota        49
Sriram         49
Aveline        49
Jeovany        49
Elizah         49
Jelissa        49
Ameir          49
Deante         49
Nassir         49
Cristine       49
Darvin         49
Nalleli        49
Shalyn         49
Kynsley        49
Rebecka        49
Alysse         49
Maurilio       49
Kyndle         49
Marquell       49
Anely          49
Ryatt          49
Mehdi          49
Mckynzie       49
Yoni           49
Hareem         49
Jkwon          49
Nazier         49

[66 rows x 1 columns]

### Step 12. What is the standard deviation of names?

In [49]:
print (names.Count.std())

11006.069467890571

### Step 13. Get a summary with the mean, min, max, std and quartiles.

In [50]:
names.describe()

               Count
count   17632.000000
mean     2008.932169
std     11006.069468
min         5.000000
25%        11.000000
50%        49.000000
75%       337.000000
max    242874.000000